Repository: SpeedJack/pweb2019
Catalog: Locale/*/LC_MESSAGES/Pweb.po
Languages: it

source: No database extension loaded: PDO or MySQLi is required.
it: Nessuna estensione PHP per la connessione al database caricata: È necessario PDO o MySQLi.

source: Unhandled Exception: %s
it: Eccezione Non Gestita: %s

source: SQL State Code: %s Query: %s
it: Codice di Stato SQL: %s Query: %s

source: Trying to set property %s in deleted entity %s.
it: Tentativo di impostare la proprietà %s nell'entità eliminata %s.

source: Trying to set an non-existent property %s for entity %s.
it: Tentativo di impostare una proprietà non esistente %s per l'entità %s.

source: Generating insecure auth token. You should update PHP to a newer version or install random_compat/OpenSSL extension.
it: Generazione di un auth token non sicuro. Dovresti aggiornare PHP a una versione più recente oppure installare l'estensione random_compat/OpenSSL.

source: The method %s::%s does not exists.
it: Il metodo %s::%s non esiste.

source: Can not add entity with hash %s since another entity of the same type already uses this id.
it: Non è stato possibile aggiungere l'entità con hash %s dato che un'altra entità dello stesso tipo utilizza già questo id.

source: Entity hash '%s' has changed unexpectedly.
it: L'hash dell'entità '%s' è cambiato inaspettatamente.

source: Invalid Entity %s.
it: Entità Non Valida %s.

source: Error parsing regular expression: '%s'.
it: Errore durante il parsing dell'espressione regolare: '%s'.

source: Invalid route: the action '%s'::'%s' does not exists.
it: Route non valida: l'azione '%s'::'%s' non esiste.

source: About Page
it: Pagina Informazioni

source: The CSS file '%s' does not exists.
it: Il file CSS '%s' non esiste.

source: The JavaScript file '%s' does not exists.
it: Il file JavaScript '%s' non esiste.

source: en
it: it

source: The template '%s' does not exists.
it: Il template '%s' non esiste.

source: You don't have the rights to view this page.
it: Non hai i permessi per vedere questa pagina.

source: Admin: Edit Challenges
it: Admin: Modifica Challenge

source: Insufficient privileges
it: Privilegi insufficienti

source: Challenges can be edited only by admins.
it: Le challenge possono essere modificate solo dagli admin.

source: Invalid challenge
it: Challenge non valida

source: The requested challenge id is not valid.
it: L'id della challenge richiesta non è valido.

source: The requested challenge could not be found.
it: La challenge richiesta non è stata trovata.

source: Edit Challenge: %s
it: Modifica Challenge: %s

source: New challenges can be created only by admins.
it: Nuove challenge possono essere create solo dagli admin.

source: Create Challenge
it: Crea Challenge

source: <span class="color-red">The requested challenge id is not valid.</span>
it: <span class="color-red">L'id della challenge richiesta non è valido.</span>

source: <span class="color-red">The requested challenge can not be found.</span>
it: <span class="color-red">La challenge richiesta non è stata trovata.</span>

source: <span class="color-red">Challenge name is too long. The name of the challenge can be long 32 characters at most.</span>
it: <span class="color-red">Il nome della challenge è troppo lungo. Il nome della challenge può essere lungo 32 caratteri al massimo.</span>

source: <span class="color-red">Category name is too long. The name of the category can be long 32 characters at most.</span>
it: <span class="color-red">Il nome della categoria è troppo lungo. Il nome della categoria può essere lungo 32 caratteri al massimo.</span>

source: <span class="color-red">Flag must match the following regex and can not be more than %s characters long: %s.</span>
it: <span class="color-red">La flag deve rispettare la seguente espressione regolare e non può essere lunga più di %s caratteri: %s.</span>

source: <span class="color-red">Challenge's points must be a valid positive non-zero integer.</span>
it: <span class="color-red">Il punteggio della challenge deve essere un valido numero intero positivo diverso da zero.</span>

source: <span class="color-red">Challenge's body text can not be empty.</span>
it: <span class="color-red">Il testo della challenge non può essere vuoto.</span>

source: <span class="color-green">Saved!</span>
it: <span class="color-green">Salvato!</span>

source: Admin: Edit Users
it: Admin: Modifica Utenti

source: Username can not be empty
it: L'username non può essere vuoto

source: Username must contains at least 5 characters and no more than 32. It can contains only letters (lowercase and uppercase), numbers and . (dot), _ (underscore), - (minus).
it: L'username deve contenere almeno 5 caratteri e non più di 32. Può contenere solo lettere (minuscole e maiuscole), numeri e . (punto), _ (underscore), - (minus).

source: This username is already in use. Please choose another username.
it: Questo username è già in uso. Per favore, scegli un altro username.

source: Email can not be empty
it: L'indirizzo email non può essere vuoto.

source: Invalid email address. Please insert a valid email address.
it: Indirizzo email non valido. Per favore, inserisci un indirizzo email valido.

source: This email is already in use. If you wish to log in, <a href="%s">click here!</a>
it: Questo indirizzo email è già in uso. Se vuoi loggarti, <a href="%s">clicca qui!</a>

source: Challenges
it: Lista Challenge

source: Challenge solved
it: Challenge risolta

source: You have already solved this challenge. Please choose another one.
it: Hai già risolto questa challenge. Per favore, scegline un'altra.

source: <span class="color-blue">Invalid challenge. Please reload the page e try again.</span>
it: <span class="color-blue">Challenge non valida. Per favore, ricarica la pagina e prova ancora.</span>

source: <span class="color-blue">The requested challenge could not be found. Please reload the page and try again.</span>
it: <span class="color-blue">La challenge richiesta non è stata trovata. Per favore, ricarica la pagina e prova ancora.</span>

source: <span class="color-red">Wrong flag!</span>
it: <span class="color-red">Flag errata!</span>

source: <span class="color-green">You have already solved this challenge.</span>
it: <span class="color-green">Hai già risolto questa challenge.</span>

source: <span class="color-green">Correct flag. You solved this challenge!</span>
it: <span class="color-green">Flag corretta. Hai risolto la challenge!</span>

source: Login Page
it: Pagina di Login

source: Error
it: Errore

source: Please, fill out all fields.
it: Per favore, riempi tutti i campi.

source: User not found
it: Utente non trovato

source: The user <em>%s</em> can not be found. If you wish to register, <a href="%s">click here!</a>
it: L'utente <em>%s</em> non è stato trovato. Se vuoi registrarti, <a href="%s">clicca qui!</a>

source: Wrong password
it: Password errata

source: Wrong password.
it: Password errata.

source: Ranking
it: Classifica

source: No users to show.
it: Nessun utente da mostrare.

source: Register an account
it: Registra un account

source: Passwords do not match.
it: Le password non coincidono.

source: Password too short
it: La password è troppo corta

source: Password must be at least %s characters long.
it: La password deve essere lunga almeno %s caratteri.

source: Account Created!
it: Account Creato!

source: Account created. <a href="%s">Log In!</a>
it: Account creato. <a href="%s">Logga!</a>

source: Invalid username
it: Username non valido

source: Username already in use
it: Username già in uso

source: Invalid email
it: Indirizzo email non valido

source: Email already in use
it: Indirizzo email già in uso

source: Invalid page.
it: Pagina non valida.

source: The requested page could not be found.
it: La pagina richiesta non è stata trovata.

source: The server encountered an internal error and was unable to process the request.
it: Si è verificato un errore interno nel server che non è stato in grado di processare la richiesta.

source: Error Message: %s
it: Messaggio di Errore: %s

source: The requested page exists but it's not fully implemented.
it: La pagina richiesta esiste ma non è completamente implementata.

source: Panic!!! Error Code: %d. Error Message: %s Backtrace: %s
it: Panic!!! Codice Errore: %d. Messaggio di Errore: %s Backtrace: %s

source: Enter Challenge Category..
it: Inserisci la Categoria della Challenge..

source: Enter Challenge Title..
it: Inserisci il Titolo della Challenge..

source: Enter Flag: flag{.....}
it: Inserisci la Flag: flag{.....}

source: Flag must have this format: flag{some text}.
it: La flag deve aver questo formato: flag{testo}.

source: Enter Body Text..
it: Inserisci Corpo..

source: Submit
it: Invia

source: Close
it: Chiudi

source: Create New Challenge
it: Crea Nuova Challenge

source: No challenges to show.
it: Nessuna challenge da mostrare.

source: points
it: punti

source: Edit
it: Modifica

source: Delete
it: Elimina

source: Delete challenge.
it: Elimina challenge.

source: Are you sure?
it: Sei sicuro?

source: Yes
it: Sì

source: Demote
it: Degrada

source: Promote
it: Promuovi

source: Promote user.
it: Promuovi utente.

source: Demote user.
it: Degrada utente.

source: Delete user.
it: Elimina utente.

source: Search..
it: Cerca..

source: Search By:
it: Cerca Per:

source: (%s points)
it: (%s punti)

source: About Us
it: Su Di Noi

source: <strong>&gt; CTF</strong> is a platform for jeopardy style CTFs. Developed by <em>Niccolò Scatena</em> for the Web Development course of the University of Pisa.
it: <strong>&gt; CTF</strong> è una piattaforma per competizioni CTF in stile jeopardy. Sviluppato da <em>Niccolò Scatena</em> per il corso di Progettazione Web dell'Università di Pisa.

source: More...
it: Altro...

source: Follow Us
it: Seguici

source: Language
it: Lingua

source: &copy; Copyright 2019 - Niccolò Scatena (University of Pisa) - All Rights Reserved.
it: &copy; Copyright 2019 - Niccolò Scatena (Università di Pisa) - Tutti i Diritti Riservati.

source: Edit Challenges
it: Modifica Challenge

source: Edit Users
it: Modifica Utenti

source: About
it: Info

source: Sign Up
it: Registrati

source: Login
it: Entra

source: Logout
it: Esci

source: Logged in as <span class="username">%s</span>.
it: Loggato come <span class="username">%s</span>.

source: Username or Email
it: Username o Email

source: Enter Username or Email
it: Inserisci Username o Email

source: Enter Password
it: Inserisci Password

source: Remember Me
it: Ricordami

source: Don't have an account? <a href="%s">Register Now!</a>
it: Non hai un account? <a href="%s">Registrati Ora!</a>

source: Top Users
it: Migliori Utenti

source: Points
it: Punti

source: Showing <strong>%s</strong> users of <strong>%s</strong>.
it: Sono mostrati <strong>%s</strong> utenti su <strong>%s</strong>.

source: Choose a Username
it: Scegli un Username

source: Enter your Email Address
it: Inserisci il tuo Indirizzo Email

source: Insert a valid email address.
it: Inserisci un indirizzo email valido.

source: Choose a Password
it: Scegli una Password

source: Enter a password of at least %s characters long.
it: Inserisci una password di almeno %s caratteri.

source: Repeat Password
it: Ripeti Password

source: Retype your Password
it: Riscrivi la tua Password

source: Retype your password, as above.
it: Riscrivi la tua password, come sopra.

source: Register
it: Registrati

source: Already have an account? <a href="%s">Log In!</a>
it: Hai già un account? <a href="%s">Logga!</a>
